package com.lab3.data

import com.lab3.R

/**
 * ItemsData - singleton class (only one instance) can be the example of shared data source
 * You can get the data from this ItemsData object from any place in the code.
 */
object ItemsData {
    val itemsList = listOf(
        Item(
            1,
            "Високий замок",
            "м. Львів, вул. Замкова",
            desc = "Найвища точка міста – 413 м над рівнем моря." +
                    "На вершині розташований оглядовий майданчик, до якого веде спіральна пішохідна доріжка. Майданчик та доріжка освітлюються в темну пору доби."
                    + "Найвищу львівську вершину давно полюбили містяни та гості Львова. І з настанням теплого сезону тут завжди збирається багато людей,оскільки звідси відкривається вид на місто.",
            image= R.drawable.vs
        ),
        Item(
            2,
            "Гора Лева",
            "м. Львів, Регіональний ландшафтний парк Знесіння",
            desc = "Один з пагорбів Давидівського пасма (частина Подільської височини), пам'ятка природи місцевого значення." +
            " Пагорб розташований неподалік від центру Львова, між вулицями Опришківською, Кривоноса і Довбуша." +
                    "Історія гори розпочалась ще в ХІV ст., коли на горі розміщувався другий замок-палац короля Лева Галицького." +
                    "Пагорб переважно незаліснений, лише його південний бік порослий деревами та кущами. На вершині облаштовано оглядовий майданчик. ",
            image = R.drawable.lysa
        ),
        Item(
            3,
            "Гора Баба Род",
            "м. Львів, вул. Старознесенська, 41",
            desc = "Гора, на якій розташовувалось давнє слов’янське капище Рода і Рожаниці та давнє городище. Розташована між нинішніми вулицями Старознесенською, Польовою та залізничною колією.  ",
            image = R.drawable.b
        ),
        Item(
            4,
            "Гора Хомець",
            "м. Львів,  Регіональний ландшафтний парк Знесіння",
            desc =  "На північний схід від Кайзервальду серед серпантину колії, що веде до станції Личаків, височіє невисока, але дуже мальовнича гора Хом (Хомець).    " +
                    "Наполовину заліснена, а південний її схил поріс як не дивно степовою травою. Неподалік, археологи знайшли в основі храму св. Іллі древню вежу, ймовірно часів самого Данила Галицького." +
                    " Це так звана вежа-стовп – популярний тип тодішньої оборони, що ставився на відстані від основних укріплень міста.",
            image = R.drawable.homets
        ),
        Item(
            5,
            "Чотові скелі",
            "м. Винники, Винниківський лісопарк",
            desc = "Група скель, а також пагорб і пам'ятка природи місцевого значення, розташовані на околиці села Лисиничі, між Львовом та Винниками." +
                    "До скель можна піднятися з села Лисиничі або з автодороги Львів – Винники (від зупинки «Винниківське озеро», близько 2 км)." +
                    "Назва пов'язана зі словом чоти (чати, чатувати, стояти на чатах), і свідчить про давнє призначення скель як сторожового поста на східних підступах до Львова.  " +
                    "На думку археологів, під скелею було найдавніше поселення на території Львова – мисливський табір.",
            image = R.drawable.ch
        )
    )
}
// Item class
class Item(val id: Int, val title: String, val description: String, val desc: String,val image: Int)